zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT758SGFOA-pinctrl.h
#define PINT0_PINT1_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT2_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT3_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT4_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT5_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT6_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define PINT0_PINT7_PIO0_14 IOPCTL_MUX(0, 14, 0) /* PIO0_14 */
#define SAI2_RX_DATA0_PIO0_14 IOPCTL_MUX(0, 14, 5) /* PIO0_14 */
#define SCT0_IN0_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN1_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN2_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN3_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN4_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN5_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_IN6_PIO0_14 IOPCTL_MUX(0, 14, 2) /* PIO0_14 */
#define SCT0_OUT8_PIO0_14 IOPCTL_MUX(0, 14, 3) /* PIO0_14 */
#define CTIMER0_CAPTURE0_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER0_CAPTURE1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER0_CAPTURE2_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER0_CAPTURE3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER1_CAPTURE0_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER1_CAPTURE1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER1_CAPTURE2_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER1_CAPTURE3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER2_CAPTURE0_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER2_CAPTURE1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER2_CAPTURE2_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER2_CAPTURE3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER3_CAPTURE0_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER3_CAPTURE1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER3_CAPTURE2_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER3_CAPTURE3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER4_CAPTURE0_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER4_CAPTURE1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER4_CAPTURE2_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER4_CAPTURE3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define CTIMER_C_INP3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define FLEXIO_TRIG0_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define FLEXIO_TRIG1_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define FLEXIO_TRIG2_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define FLEXIO_TRIG3_PIO0_15 IOPCTL_MUX(0, 15, 4) /* PIO0_15 */
#define GPIO0_GPIO15_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define LP_FLEXCOMM2_P5_PIO0_15 IOPCTL_MUX(0, 15, 6) /* PIO0_15 */
#define LP_FLEXCOMM5_P5_PIO0_15 IOPCTL_MUX(0, 15, 1) /* PIO0_15 */
#define PINT0_PINT0_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT1_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT2_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT3_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT4_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT5_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT6_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define PINT0_PINT7_PIO0_15 IOPCTL_MUX(0, 15, 0) /* PIO0_15 */
#define SAI2_RX_BCLK_PIO0_15 IOPCTL_MUX(0, 15, 5) /* PIO0_15 */
#define SCT0_IN0_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN1_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN2_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN3_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN4_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN5_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_IN6_PIO0_15 IOPCTL_MUX(0, 15, 2) /* PIO0_15 */
#define SCT0_OUT2_PIO0_15 IOPCTL_MUX(0, 15, 3) /* PIO0_15 */
#define CTIMER0_MATCH1_PIO0_16 IOPCTL_MUX(0, 16, 4) /* PIO0_16 */
#define GPIO0_GPIO16_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define LP_FLEXCOMM2_P6_PIO0_16 IOPCTL_MUX(0, 16, 6) /* PIO0_16 */
#define LP_FLEXCOMM5_P6_PIO0_16 IOPCTL_MUX(0, 16, 1) /* PIO0_16 */
#define PINT0_PINT0_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT1_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT2_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT3_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT4_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT5_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT6_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define PINT0_PINT7_PIO0_16 IOPCTL_MUX(0, 16, 0) /* PIO0_16 */
#define SAI2_RX_SYNC_PIO0_16 IOPCTL_MUX(0, 16, 5) /* PIO0_16 */
#define SCT0_IN0_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN1_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN2_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN3_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN4_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN5_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_IN6_PIO0_16 IOPCTL_MUX(0, 16, 2) /* PIO0_16 */
#define SCT0_OUT3_PIO0_16 IOPCTL_MUX(0, 16, 3) /* PIO0_16 */
#define CTIMER2_MATCH0_PIO0_17 IOPCTL_MUX(0, 17, 4) /* PIO0_17 */
#define GPIO0_GPIO17_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define LP_FLEXCOMM6_P5_PIO0_17 IOPCTL_MUX(0, 17, 1) /* PIO0_17 */
#define PINT0_PINT0_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT1_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT2_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT3_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT4_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT5_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT6_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define PINT0_PINT7_PIO0_17 IOPCTL_MUX(0, 17, 0) /* PIO0_17 */
#define SAI1_RX_BCLK_PIO0_17 IOPCTL_MUX(0, 17, 5) /* PIO0_17 */
#define SCT0_IN0_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN1_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN2_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN3_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN4_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN5_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_IN6_PIO0_17 IOPCTL_MUX(0, 17, 2) /* PIO0_17 */
#define SCT0_OUT0_PIO0_17 IOPCTL_MUX(0, 17, 3) /* PIO0_17 */
#define CTIMER2_MATCH1_PIO0_18 IOPCTL_MUX(0, 18, 4) /* PIO0_18 */
#define GPIO0_GPIO18_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define LP_FLEXCOMM6_P6_PIO0_18 IOPCTL_MUX(0, 18, 1) /* PIO0_18 */
#define PINT0_PINT0_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT1_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT2_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT3_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT4_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT5_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT6_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define PINT0_PINT7_PIO0_18 IOPCTL_MUX(0, 18, 0) /* PIO0_18 */
#define SAI1_RX_DATA0_PIO0_18 IOPCTL_MUX(0, 18, 5) /* PIO0_18 */
#define SCT0_IN0_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN1_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN2_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN3_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN4_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN5_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_IN6_PIO0_18 IOPCTL_MUX(0, 18, 2) /* PIO0_18 */
#define SCT0_OUT1_PIO0_18 IOPCTL_MUX(0, 18, 3) /* PIO0_18 */
#define CTIMER2_MATCH2_PIO0_19 IOPCTL_MUX(0, 19, 4) /* PIO0_19 */
#define GPIO0_GPIO19_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define LP_FLEXCOMM6_P2_PIO0_19 IOPCTL_MUX(0, 19, 1) /* PIO0_19 */
#define PINT0_PINT0_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT1_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT2_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT3_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT4_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT5_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT6_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define PINT0_PINT7_PIO0_19 IOPCTL_MUX(0, 19, 0) /* PIO0_19 */
#define SAI1_RX_SYNC_PIO0_19 IOPCTL_MUX(0, 19, 5) /* PIO0_19 */
#define SCT0_IN0_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN1_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN2_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN3_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN4_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN5_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_IN6_PIO0_19 IOPCTL_MUX(0, 19, 2) /* PIO0_19 */
#define SCT0_OUT2_PIO0_19 IOPCTL_MUX(0, 19, 3) /* PIO0_19 */
#define CTIMER2_MATCH3_PIO0_20 IOPCTL_MUX(0, 20, 4) /* PIO0_20 */
#define GPIO0_GPIO20_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define LP_FLEXCOMM6_P3_PIO0_20 IOPCTL_MUX(0, 20, 1) /* PIO0_20 */
#define PINT0_PINT0_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT1_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT2_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT3_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT4_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT5_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT6_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define PINT0_PINT7_PIO0_20 IOPCTL_MUX(0, 20, 0) /* PIO0_20 */
#define SAI1_TX_BCLK_PIO0_20 IOPCTL_MUX(0, 20, 5) /* PIO0_20 */
#define SCT0_IN0_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN1_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN2_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN3_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN4_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN5_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_IN6_PIO0_20 IOPCTL_MUX(0, 20, 2) /* PIO0_20 */
#define SCT0_OUT3_PIO0_20 IOPCTL_MUX(0, 20, 3) /* PIO0_20 */
#define CLKCTL0_MCLK_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define CTIMER0_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER0_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER0_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER0_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER1_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER2_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER3_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE0_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE1_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE2_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER4_CAPTURE3_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define CTIMER_C_INP4_PIO0_21 IOPCTL_MUX(0, 21, 4) /* PIO0_21 */
#define GPIO0_GPIO21_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define LP_FLEXCOMM6_P0_PIO0_21 IOPCTL_MUX(0, 21, 1) /* PIO0_21 */
#define PINT0_PINT0_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT1_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT2_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT3_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT4_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT5_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT6_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define PINT0_PINT7_PIO0_21 IOPCTL_MUX(0, 21, 0) /* PIO0_21 */
#define SAI1_TX_DATA0_PIO0_21 IOPCTL_MUX(0, 21, 5) /* PIO0_21 */
#define SCT0_IN0_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN1_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN2_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN3_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN4_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN5_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_IN6_PIO0_21 IOPCTL_MUX(0, 21, 6) /* PIO0_21 */
#define SCT0_OUT6_PIO0_21 IOPCTL_MUX(0, 21, 3) /* PIO0_21 */
#define CLKCTL0_CLKOUT_VDD2_PIO0_22 IOPCTL_MUX(0, 22, 6) /* PIO0_22 */
#define CTIMER0_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER0_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER0_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER0_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER1_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER2_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER3_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE0_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE1_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE2_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER4_CAPTURE3_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define CTIMER_C_INP5_PIO0_22 IOPCTL_MUX(0, 22, 4) /* PIO0_22 */
#define GPIO0_GPIO22_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define LP_FLEXCOMM6_P1_PIO0_22 IOPCTL_MUX(0, 22, 1) /* PIO0_22 */
#define PINT0_PINT0_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT1_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT2_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT3_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT4_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT5_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT6_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define PINT0_PINT7_PIO0_22 IOPCTL_MUX(0, 22, 0) /* PIO0_22 */
#define SAI1_TX_SYNC_PIO0_22 IOPCTL_MUX(0, 22, 5) /* PIO0_22 */
#define SCT0_IN0_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN1_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN2_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN3_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN4_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN5_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_IN6_PIO0_22 IOPCTL_MUX(0, 22, 2) /* PIO0_22 */
#define SCT0_OUT4_PIO0_22 IOPCTL_MUX(0, 22, 3) /* PIO0_22 */
#define CTIMER4_MATCH0_PIO0_31 IOPCTL_MUX(0, 31, 4) /* PIO0_31 */
#define GPIO0_GPIO31_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define LP_FLEXCOMM0_P0_PIO0_31 IOPCTL_MUX(0, 31, 1) /* PIO0_31 */
#define PINT0_PINT0_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT1_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT2_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT3_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT4_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT5_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT6_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define PINT0_PINT7_PIO0_31 IOPCTL_MUX(0, 31, 0) /* PIO0_31 */
#define SCT0_OUT8_PIO0_31 IOPCTL_MUX(0, 31, 3) /* PIO0_31 */
#define UTICK0_CAPTURE2_PIO0_31 IOPCTL_MUX(0, 31, 2) /* PIO0_31 */
#define CTIMER4_MATCH1_PIO1_0 IOPCTL_MUX(0, 32, 4) /* PIO1_0 */
#define GPIO1_GPIO0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define LP_FLEXCOMM0_P1_PIO1_0 IOPCTL_MUX(0, 32, 1) /* PIO1_0 */
#define PINT0_PINT0_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT1_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT2_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT3_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT4_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT5_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT6_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define PINT0_PINT7_PIO1_0 IOPCTL_MUX(0, 32, 0) /* PIO1_0 */
#define SCT0_OUT9_PIO1_0 IOPCTL_MUX(0, 32, 3) /* PIO1_0 */
#define CLKCTL3_CLKOUT_VDD1_PIO1_2 IOPCTL_MUX(0, 34, 6) /* PIO1_2 */
#define CTIMER4_MATCH3_PIO1_2 IOPCTL_MUX(0, 34, 4) /* PIO1_2 */
#define GPIO1_GPIO2_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define LP_FLEXCOMM0_P3_PIO1_2 IOPCTL_MUX(0, 34, 1) /* PIO1_2 */
#define LP_FLEXCOMM9_P5_PIO1_2 IOPCTL_MUX(0, 34, 5) /* PIO1_2 */
#define PINT0_PINT0_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT1_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT2_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT3_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT4_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT5_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT6_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define PINT0_PINT7_PIO1_2 IOPCTL_MUX(0, 34, 0) /* PIO1_2 */
#define SCT0_IN0_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN1_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN2_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN3_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN4_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN5_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_IN6_PIO1_2 IOPCTL_MUX(0, 34, 2) /* PIO1_2 */
#define SCT0_OUT6_PIO1_2 IOPCTL_MUX(0, 34, 3) /* PIO1_2 */
#define CTIMER0_CAPTURE0_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER0_CAPTURE1_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER0_CAPTURE2_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER0_CAPTURE3_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER1_CAPTURE0_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER1_CAPTURE1_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER1_CAPTURE2_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER1_CAPTURE3_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER2_CAPTURE0_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER2_CAPTURE1_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER2_CAPTURE2_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER2_CAPTURE3_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER3_CAPTURE0_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER3_CAPTURE1_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER3_CAPTURE2_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER3_CAPTURE3_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER4_CAPTURE0_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER4_CAPTURE1_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER4_CAPTURE2_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER4_CAPTURE3_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define CTIMER_C_INP8_PIO1_3 IOPCTL_MUX(0, 35, 4) /* PIO1_3 */
#define GPIO1_GPIO3_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define LP_FLEXCOMM0_P4_PIO1_3 IOPCTL_MUX(0, 35, 1) /* PIO1_3 */
#define LP_FLEXCOMM9_P6_PIO1_3 IOPCTL_MUX(0, 35, 5) /* PIO1_3 */
#define PINT0_PINT0_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT1_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT2_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT3_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT4_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT5_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT6_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PINT0_PINT7_PIO1_3 IOPCTL_MUX(0, 35, 0) /* PIO1_3 */
#define PIN_32KHZ_CLKOUT_PIO1_3 IOPCTL_MUX(0, 35, 6) /* PIO1_3 */
#define SCT0_IN0_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_IN1_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_IN2_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_IN3_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_IN4_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_IN5_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_IN6_PIO1_3 IOPCTL_MUX(0, 35, 2) /* PIO1_3 */
#define SCT0_OUT7_PIO1_3 IOPCTL_MUX(0, 35, 3) /* PIO1_3 */
#define CTIMER1_MATCH0_PIO1_4 IOPCTL_MUX(0, 36, 4) /* PIO1_4 */
#define GPIO1_GPIO4_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define LP_FLEXCOMM0_P5_PIO1_4 IOPCTL_MUX(0, 36, 1) /* PIO1_4 */
#define LP_FLEXCOMM9_P3_PIO1_4 IOPCTL_MUX(0, 36, 5) /* PIO1_4 */
#define PINT0_PINT0_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT1_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT2_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT3_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT4_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT5_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT6_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define PINT0_PINT7_PIO1_4 IOPCTL_MUX(0, 36, 0) /* PIO1_4 */
#define SCT0_IN0_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_IN1_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_IN2_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_IN3_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_IN4_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_IN5_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_IN6_PIO1_4 IOPCTL_MUX(0, 36, 2) /* PIO1_4 */
#define SCT0_OUT8_PIO1_4 IOPCTL_MUX(0, 36, 3) /* PIO1_4 */
#define CTIMER1_MATCH1_PIO1_5 IOPCTL_MUX(0, 37, 4) /* PIO1_5 */
#define GPIO1_GPIO5_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define LP_FLEXCOMM0_P6_PIO1_5 IOPCTL_MUX(0, 37, 1) /* PIO1_5 */
#define LP_FLEXCOMM9_P4_PIO1_5 IOPCTL_MUX(0, 37, 5) /* PIO1_5 */
#define PINT0_PINT0_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT1_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT2_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT3_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT4_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT5_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT6_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define PINT0_PINT7_PIO1_5 IOPCTL_MUX(0, 37, 0) /* PIO1_5 */
#define SCT0_IN0_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_IN1_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_IN2_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_IN3_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_IN4_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_IN5_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_IN6_PIO1_5 IOPCTL_MUX(0, 37, 2) /* PIO1_5 */
#define SCT0_OUT9_PIO1_5 IOPCTL_MUX(0, 37, 3) /* PIO1_5 */
#define CTIMER0_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER0_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER0_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER0_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER1_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
