zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT758SGFOA-pinctrl.h
#define CTIMER2_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER2_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER3_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE0_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE1_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE2_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER4_CAPTURE3_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define CTIMER_C_INP12_PIO1_6 IOPCTL_MUX(0, 38, 4) /* PIO1_6 */
#define GPIO1_GPIO6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define I3C1_PUR_PIO1_6 IOPCTL_MUX(0, 38, 5) /* PIO1_6 */
#define LP_FLEXCOMM1_P4_PIO1_6 IOPCTL_MUX(0, 38, 1) /* PIO1_6 */
#define PINT0_PINT0_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT1_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT2_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT3_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT4_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT5_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT6_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define PINT0_PINT7_PIO1_6 IOPCTL_MUX(0, 38, 0) /* PIO1_6 */
#define SCT0_IN0_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN1_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN2_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN3_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN4_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN5_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_IN6_PIO1_6 IOPCTL_MUX(0, 38, 2) /* PIO1_6 */
#define SCT0_OUT0_PIO1_6 IOPCTL_MUX(0, 38, 3) /* PIO1_6 */
#define CTIMER0_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER0_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER1_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER2_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER3_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE0_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE1_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE2_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER4_CAPTURE3_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define CTIMER_C_INP13_PIO1_7 IOPCTL_MUX(0, 39, 4) /* PIO1_7 */
#define GPIO1_GPIO7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define I3C1_SDA_PIO1_7 IOPCTL_MUX(0, 39, 5) /* PIO1_7 */
#define LP_FLEXCOMM1_P0_PIO1_7 IOPCTL_MUX(0, 39, 1) /* PIO1_7 */
#define PINT0_PINT0_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT1_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT2_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT3_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT4_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT5_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT6_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define PINT0_PINT7_PIO1_7 IOPCTL_MUX(0, 39, 0) /* PIO1_7 */
#define SCT0_IN0_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN1_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN2_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN3_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN4_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN5_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_IN6_PIO1_7 IOPCTL_MUX(0, 39, 2) /* PIO1_7 */
#define SCT0_OUT1_PIO1_7 IOPCTL_MUX(0, 39, 3) /* PIO1_7 */
#define CTIMER0_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER0_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER0_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER0_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER1_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER2_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER3_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE0_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE1_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE2_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER4_CAPTURE3_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define CTIMER_C_INP14_PIO1_8 IOPCTL_MUX(0, 40, 4) /* PIO1_8 */
#define GPIO1_GPIO8_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define I3C1_SCL_PIO1_8 IOPCTL_MUX(0, 40, 5) /* PIO1_8 */
#define LP_FLEXCOMM1_P1_PIO1_8 IOPCTL_MUX(0, 40, 1) /* PIO1_8 */
#define PINT0_PINT0_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT1_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT2_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT3_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT4_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT5_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT6_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define PINT0_PINT7_PIO1_8 IOPCTL_MUX(0, 40, 0) /* PIO1_8 */
#define SCT0_IN0_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN1_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN2_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN3_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN4_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN5_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_IN6_PIO1_8 IOPCTL_MUX(0, 40, 2) /* PIO1_8 */
#define SCT0_OUT2_PIO1_8 IOPCTL_MUX(0, 40, 3) /* PIO1_8 */
#define CLKCTL0_CLKIN_PIO1_9 IOPCTL_MUX(0, 41, 5) /* PIO1_9 */
#define CLKCTL3_CLKOUT_VDD1_PIO1_9 IOPCTL_MUX(0, 41, 6) /* PIO1_9 */
#define CTIMER0_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER0_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER0_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER0_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER1_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER2_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER3_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE0_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE1_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE2_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER4_CAPTURE3_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define CTIMER_C_INP15_PIO1_9 IOPCTL_MUX(0, 41, 4) /* PIO1_9 */
#define GPIO1_GPIO9_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define LP_FLEXCOMM1_P2_PIO1_9 IOPCTL_MUX(0, 41, 1) /* PIO1_9 */
#define PINT0_PINT0_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT1_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT2_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT3_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT4_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT5_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT6_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define PINT0_PINT7_PIO1_9 IOPCTL_MUX(0, 41, 0) /* PIO1_9 */
#define SCT0_IN0_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN1_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN2_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN3_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN4_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN5_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_IN6_PIO1_9 IOPCTL_MUX(0, 41, 2) /* PIO1_9 */
#define SCT0_OUT3_PIO1_9 IOPCTL_MUX(0, 41, 3) /* PIO1_9 */
#define CLKCTL3_CLKOUT_VDD1_PIO1_10 IOPCTL_MUX(0, 42, 6) /* PIO1_10 */
#define CTIMER2_MATCH1_PIO1_10 IOPCTL_MUX(0, 42, 4) /* PIO1_10 */
#define GPIO1_GPIO10_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define LP_FLEXCOMM1_P3_PIO1_10 IOPCTL_MUX(0, 42, 1) /* PIO1_10 */
#define PINT0_PINT0_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT1_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT2_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT3_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT4_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT5_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT6_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define PINT0_PINT7_PIO1_10 IOPCTL_MUX(0, 42, 0) /* PIO1_10 */
#define SWD_TRACECLK_PIO1_10 IOPCTL_MUX(0, 42, 5) /* PIO1_10 */
#define UTICK0_CAPTURE3_PIO1_10 IOPCTL_MUX(0, 42, 2) /* PIO1_10 */
#define CTIMER2_MATCH2_PIO1_11 IOPCTL_MUX(0, 43, 4) /* PIO1_11 */
#define GPIO1_GPIO11_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define LP_FLEXCOMM2_P0_PIO1_11 IOPCTL_MUX(0, 43, 1) /* PIO1_11 */
#define PINT0_PINT0_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT1_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT2_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT3_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT4_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT5_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT6_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define PINT0_PINT7_PIO1_11 IOPCTL_MUX(0, 43, 0) /* PIO1_11 */
#define SWD_TRACEDATA0_PIO1_11 IOPCTL_MUX(0, 43, 5) /* PIO1_11 */
#define CTIMER1_MATCH1_PIO1_12 IOPCTL_MUX(0, 44, 4) /* PIO1_12 */
#define GPIO1_GPIO12_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define LP_FLEXCOMM2_P1_PIO1_12 IOPCTL_MUX(0, 44, 1) /* PIO1_12 */
#define PINT0_PINT0_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT1_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT2_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT3_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT4_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT5_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT6_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define PINT0_PINT7_PIO1_12 IOPCTL_MUX(0, 44, 0) /* PIO1_12 */
#define SCT0_IN0_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN1_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN2_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN3_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN4_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN5_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_IN6_PIO1_12 IOPCTL_MUX(0, 44, 2) /* PIO1_12 */
#define SCT0_OUT9_PIO1_12 IOPCTL_MUX(0, 44, 3) /* PIO1_12 */
#define SWD_TRACEDATA1_PIO1_12 IOPCTL_MUX(0, 44, 5) /* PIO1_12 */
#define CTIMER2_MATCH3_PIO1_13 IOPCTL_MUX(0, 45, 4) /* PIO1_13 */
#define GPIO1_GPIO13_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define LP_FLEXCOMM2_P4_PIO1_13 IOPCTL_MUX(0, 45, 1) /* PIO1_13 */
#define PINT0_PINT0_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT1_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT2_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT3_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT4_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT5_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT6_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PINT0_PINT7_PIO1_13 IOPCTL_MUX(0, 45, 0) /* PIO1_13 */
#define PIN_32KHZ_CLKOUT_PIO1_13 IOPCTL_MUX(0, 45, 6) /* PIO1_13 */
#define SWD_TRACEDATA2_PIO1_13 IOPCTL_MUX(0, 45, 5) /* PIO1_13 */
#define UTICK0_CAPTURE1_PIO1_13 IOPCTL_MUX(0, 45, 2) /* PIO1_13 */
#define CTIMER3_MATCH0_PIO1_14 IOPCTL_MUX(0, 46, 4) /* PIO1_14 */
#define GPIO1_GPIO14_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define LP_FLEXCOMM2_P2_PIO1_14 IOPCTL_MUX(0, 46, 1) /* PIO1_14 */
#define PINT0_PINT0_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT1_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT2_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT3_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT4_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT5_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT6_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define PINT0_PINT7_PIO1_14 IOPCTL_MUX(0, 46, 0) /* PIO1_14 */
#define SWD_TRACEDATA3_PIO1_14 IOPCTL_MUX(0, 46, 5) /* PIO1_14 */
#define CLKCTL0_CLKIN_PIO1_15 IOPCTL_MUX(0, 47, 5) /* PIO1_15 */
#define CTIMER3_MATCH1_PIO1_15 IOPCTL_MUX(0, 47, 4) /* PIO1_15 */
#define GPIO1_GPIO15_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define LP_FLEXCOMM2_P3_PIO1_15 IOPCTL_MUX(0, 47, 1) /* PIO1_15 */
#define PINT0_PINT0_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT1_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT2_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT3_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT4_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT5_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT6_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT7_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define CTIMER3_MATCH2_PIO1_16 IOPCTL_MUX(0, 48, 4) /* PIO1_16 */
#define GPIO1_GPIO16_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define I3C0_PUR_PIO1_16 IOPCTL_MUX(0, 48, 5) /* PIO1_16 */
#define LP_FLEXCOMM3_P2_PIO1_16 IOPCTL_MUX(0, 48, 1) /* PIO1_16 */
#define PINT0_PINT0_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT1_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT2_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT3_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT4_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT5_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT6_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT7_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define CTIMER3_MATCH3_PIO1_17 IOPCTL_MUX(0, 49, 4) /* PIO1_17 */
#define GPIO1_GPIO17_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define I3C0_SCL_PIO1_17 IOPCTL_MUX(0, 49, 5) /* PIO1_17 */
#define LP_FLEXCOMM3_P1_PIO1_17 IOPCTL_MUX(0, 49, 1) /* PIO1_17 */
#define PINT0_PINT0_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT1_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT2_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT3_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT4_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT5_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT6_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT7_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define USB0_OVERCURRENTN_PIO1_17 IOPCTL_MUX(0, 49, 2) /* PIO1_17 */
#define CTIMER4_MATCH0_PIO1_18 IOPCTL_MUX(0, 50, 4) /* PIO1_18 */
#define GPIO1_GPIO18_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define I3C0_SDA_PIO1_18 IOPCTL_MUX(0, 50, 5) /* PIO1_18 */
#define LP_FLEXCOMM3_P0_PIO1_18 IOPCTL_MUX(0, 50, 1) /* PIO1_18 */
#define PINT0_PINT0_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT1_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT2_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT3_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT4_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT5_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT6_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT7_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define USB0_PORTPWRN_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define CLKCTL0_MCLK_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define CTIMER4_MATCH1_PIO1_19 IOPCTL_MUX(0, 51, 4) /* PIO1_19 */
#define FREQME_GPIO_B_CLK_PIO1_19 IOPCTL_MUX(0, 51, 3) /* PIO1_19 */
#define FREQME_IN0_PIO1_19 IOPCTL_MUX(0, 51, 3) /* PIO1_19 */
#define FREQME_IN1_PIO1_19 IOPCTL_MUX(0, 51, 3) /* PIO1_19 */
#define GPIO1_GPIO19_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define LP_FLEXCOMM3_P3_PIO1_19 IOPCTL_MUX(0, 51, 1) /* PIO1_19 */
#define PINT0_PINT0_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT1_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT2_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT3_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT4_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT5_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT6_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define PINT0_PINT7_PIO1_19 IOPCTL_MUX(0, 51, 0) /* PIO1_19 */
#define SCT0_IN0_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define SCT0_IN1_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define SCT0_IN2_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define SCT0_IN3_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define SCT0_IN4_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define SCT0_IN5_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define SCT0_IN6_PIO1_19 IOPCTL_MUX(0, 51, 2) /* PIO1_19 */
#define EZHV_PIO0_PIO2_0 IOPCTL_MUX(0, 64, 4) /* PIO2_0 */
#define FLEXIO_IO0_PIO2_0 IOPCTL_MUX(0, 64, 5) /* PIO2_0 */
#define GPIO2_GPIO0_PIO2_0 IOPCTL_MUX(0, 64, 0) /* PIO2_0 */
#define LCD_DBI_CSX_AB_PIO2_0 IOPCTL_MUX(0, 64, 7) /* PIO2_0 */
#define USB0_OVERCURRENTN_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define EZHV_PIO1_PIO2_1 IOPCTL_MUX(0, 65, 4) /* PIO2_1 */
#define FLEXIO_IO1_PIO2_1 IOPCTL_MUX(0, 65, 5) /* PIO2_1 */
#define GPIO2_GPIO1_PIO2_1 IOPCTL_MUX(0, 65, 0) /* PIO2_1 */
#define LCD_DBI_DCX_AB_PIO2_1 IOPCTL_MUX(0, 65, 7) /* PIO2_1 */
#define USB0_PORTPWRN_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define EZHV_PIO2_PIO2_2 IOPCTL_MUX(0, 66, 4) /* PIO2_2 */
#define FLEXIO_IO2_PIO2_2 IOPCTL_MUX(0, 66, 5) /* PIO2_2 */
#define GPIO2_GPIO2_PIO2_2 IOPCTL_MUX(0, 66, 0) /* PIO2_2 */
#define LCD_DBI_DATA_OEN_PIO2_2 IOPCTL_MUX(0, 66, 7) /* PIO2_2 */
#define LCD_ENABLE_PIO2_2 IOPCTL_MUX(0, 66, 6) /* PIO2_2 */
#define LPSPI16_SOUT_PIO2_2 IOPCTL_MUX(0, 66, 1) /* PIO2_2 */
#define EZHV_PIO3_PIO2_3 IOPCTL_MUX(0, 67, 4) /* PIO2_3 */
#define FLEXIO_IO3_PIO2_3 IOPCTL_MUX(0, 67, 5) /* PIO2_3 */
#define GPIO2_GPIO3_PIO2_3 IOPCTL_MUX(0, 67, 0) /* PIO2_3 */
#define LCD_DBI_RWDX_PIO2_3 IOPCTL_MUX(0, 67, 7) /* PIO2_3 */
#define LCD_DOTCLK_PIO2_3 IOPCTL_MUX(0, 67, 6) /* PIO2_3 */
#define LPSPI16_SCK_PIO2_3 IOPCTL_MUX(0, 67, 1) /* PIO2_3 */
#define EZHV_PIO4_PIO2_4 IOPCTL_MUX(0, 68, 4) /* PIO2_4 */
#define FLEXIO_IO4_PIO2_4 IOPCTL_MUX(0, 68, 5) /* PIO2_4 */
#define GPIO2_GPIO4_PIO2_4 IOPCTL_MUX(0, 68, 0) /* PIO2_4 */
#define LCD_DBI_WRX_PIO2_4 IOPCTL_MUX(0, 68, 7) /* PIO2_4 */
#define LCD_HSYNC_PIO2_4 IOPCTL_MUX(0, 68, 6) /* PIO2_4 */
#define LPSPI16_SIN_PIO2_4 IOPCTL_MUX(0, 68, 1) /* PIO2_4 */
#define EZHV_PIO5_PIO2_5 IOPCTL_MUX(0, 69, 4) /* PIO2_5 */
#define FLEXIO_IO5_PIO2_5 IOPCTL_MUX(0, 69, 5) /* PIO2_5 */
#define GPIO2_GPIO5_PIO2_5 IOPCTL_MUX(0, 69, 0) /* PIO2_5 */
#define LCD_DBI_E_PIO2_5 IOPCTL_MUX(0, 69, 7) /* PIO2_5 */
#define LCD_VSYNC_PIO2_5 IOPCTL_MUX(0, 69, 6) /* PIO2_5 */
#define LPSPI16_PCS0_PIO2_5 IOPCTL_MUX(0, 69, 1) /* PIO2_5 */
#define FLEXIO_IO6_PIO2_6 IOPCTL_MUX(0, 70, 5) /* PIO2_6 */
#define GPIO2_GPIO6_PIO2_6 IOPCTL_MUX(0, 70, 0) /* PIO2_6 */
#define LCDIF_DATA0_PIO2_6 IOPCTL_MUX(0, 70, 6) /* PIO2_6 */
#define LCDIF_DBI_DATA0_PIO2_6 IOPCTL_MUX(0, 70, 7) /* PIO2_6 */
#define LPSPI16_PCS3_PIO2_6 IOPCTL_MUX(0, 70, 1) /* PIO2_6 */
#define EZHV_PIO7_PIO2_7 IOPCTL_MUX(0, 71, 4) /* PIO2_7 */
#define FLEXIO_IO7_PIO2_7 IOPCTL_MUX(0, 71, 5) /* PIO2_7 */
#define GPIO2_GPIO7_PIO2_7 IOPCTL_MUX(0, 71, 0) /* PIO2_7 */
#define LCDIF_DATA1_PIO2_7 IOPCTL_MUX(0, 71, 6) /* PIO2_7 */
#define LCDIF_DBI_DATA1_PIO2_7 IOPCTL_MUX(0, 71, 7) /* PIO2_7 */
#define LPSPI16_PCS2_PIO2_7 IOPCTL_MUX(0, 71, 1) /* PIO2_7 */
#define EZHV_PIO8_PIO2_8 IOPCTL_MUX(0, 72, 4) /* PIO2_8 */
#define FLEXIO_IO8_PIO2_8 IOPCTL_MUX(0, 72, 5) /* PIO2_8 */
#define GPIO2_GPIO8_PIO2_8 IOPCTL_MUX(0, 72, 0) /* PIO2_8 */
#define LCDIF_DATA2_PIO2_8 IOPCTL_MUX(0, 72, 6) /* PIO2_8 */
#define LCDIF_DBI_DATA2_PIO2_8 IOPCTL_MUX(0, 72, 7) /* PIO2_8 */
#define LPSPI16_PCS1_PIO2_8 IOPCTL_MUX(0, 72, 1) /* PIO2_8 */
#define EZHV_PIO9_PIO2_9 IOPCTL_MUX(0, 73, 4) /* PIO2_9 */
#define FLEXIO_IO9_PIO2_9 IOPCTL_MUX(0, 73, 5) /* PIO2_9 */
#define GPIO2_GPIO9_PIO2_9 IOPCTL_MUX(0, 73, 0) /* PIO2_9 */
#define LCDIF_DATA3_PIO2_9 IOPCTL_MUX(0, 73, 6) /* PIO2_9 */
#define LCDIF_DBI_DATA3_PIO2_9 IOPCTL_MUX(0, 73, 7) /* PIO2_9 */
#define EZHV_PIO10_PIO2_10 IOPCTL_MUX(0, 74, 4) /* PIO2_10 */
#define FLEXIO_IO10_PIO2_10 IOPCTL_MUX(0, 74, 5) /* PIO2_10 */
#define GPIO2_GPIO10_PIO2_10 IOPCTL_MUX(0, 74, 0) /* PIO2_10 */
#define LCDIF_DATA4_PIO2_10 IOPCTL_MUX(0, 74, 6) /* PIO2_10 */
#define LCDIF_DBI_DATA4_PIO2_10 IOPCTL_MUX(0, 74, 7) /* PIO2_10 */
#define EZHV_PIO11_PIO2_11 IOPCTL_MUX(0, 75, 4) /* PIO2_11 */
#define FLEXIO_IO11_PIO2_11 IOPCTL_MUX(0, 75, 5) /* PIO2_11 */
#define GPIO2_GPIO11_PIO2_11 IOPCTL_MUX(0, 75, 0) /* PIO2_11 */
#define LCDIF_DATA5_PIO2_11 IOPCTL_MUX(0, 75, 6) /* PIO2_11 */
#define LCDIF_DBI_DATA5_PIO2_11 IOPCTL_MUX(0, 75, 7) /* PIO2_11 */
#define EZHV_PIO12_PIO2_12 IOPCTL_MUX(0, 76, 4) /* PIO2_12 */
#define FLEXIO_IO12_PIO2_12 IOPCTL_MUX(0, 76, 5) /* PIO2_12 */
#define GPIO2_GPIO12_PIO2_12 IOPCTL_MUX(0, 76, 0) /* PIO2_12 */
#define LCDIF_DATA6_PIO2_12 IOPCTL_MUX(0, 76, 6) /* PIO2_12 */
#define LCDIF_DBI_DATA6_PIO2_12 IOPCTL_MUX(0, 76, 7) /* PIO2_12 */
#define EZHV_PIO13_PIO2_13 IOPCTL_MUX(0, 77, 4) /* PIO2_13 */
#define FLEXIO_IO13_PIO2_13 IOPCTL_MUX(0, 77, 5) /* PIO2_13 */
#define GPIO2_GPIO13_PIO2_13 IOPCTL_MUX(0, 77, 0) /* PIO2_13 */
#define LCDIF_DATA7_PIO2_13 IOPCTL_MUX(0, 77, 6) /* PIO2_13 */
#define LCDIF_DBI_DATA7_PIO2_13 IOPCTL_MUX(0, 77, 7) /* PIO2_13 */
#define CLKCTL0_LOW_FREQ_CLKOUT_PIO2_14 IOPCTL_MUX(0, 78, 6) /* PIO2_14 */
#define EZHV_PIO14_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define FLEXIO_IO14_PIO2_14 IOPCTL_MUX(0, 78, 5) /* PIO2_14 */
#define GPIO2_GPIO14_PIO2_14 IOPCTL_MUX(0, 78, 0) /* PIO2_14 */
#define CLKCTL0_LOW_FREQ_CLKOUT_N_PIO2_15 IOPCTL_MUX(0, 79, 6) /* PIO2_15 */
#define EZHV_PIO15_PIO2_15 IOPCTL_MUX(0, 79, 4) /* PIO2_15 */
#define FLEXIO_IO15_PIO2_15 IOPCTL_MUX(0, 79, 5) /* PIO2_15 */
